"""
Файлдармен жұмыс жасау Python тілінде өте маңызды,
себебі көптеген мәліметтер файлдар арқылы сақталады және өңделеді.
Python-да файлдармен жұмыс істеу үшін open() функциясы қолданылады.
Бұл функция файлды ашып, онымен жұмыс істеуге мүмкіндік береді.
"""


"""
"r" — оқу режимі. Егер файл жоқ болса, қате береді.
"w" — жазу режимі. Егер файл жоқ болса, оны жасайды, егер файл бар болса, оның мазмұнын өшіреді.
"a" — қосу режимі. Егер файл жоқ болса, оны жасайды, файл бар болса, жаңа мәліметтерді соңына қосады.
"b" — бинарлы режим. Мысалы, сурет файлдарымен жұмыс істегенде.
"""

# file = open("example.txt", "w")
# content = file.write('fvfdvfvfvf')
# print(content)
# file.close()

#read, readline, readlines
# file = open("example.txt")
# line = file.readline(30)
# print(line)
# file.close()
# #Егер біз ридлайнға сан беретін болсақ онда ол бірінші линиядағы символдар санын оқиды
#
# file = open('example.txt')
# line = file.read(30)
# print(line)
# file.close()


# file = open("example.txt", "r")
# lines = file.readlines()
# print(lines)
# print(lines[2])
# file.close()