"""
Файлдармен жұмыс жасау Python тілінде өте маңызды,
себебі көптеген мәліметтер файлдар арқылы сақталады және өңделеді.
Python-да файлдармен жұмыс істеу үшін open() функциясы қолданылады.
Бұл функция файлды ашып, онымен жұмыс істеуге мүмкіндік береді.
"""

#read, write

"""
"r" — оқу режимі. Егер файл жоқ болса, қате береді.
"w" — жазу режимі. Егер файл жоқ болса, оны жасайды, егер файл бар болса, оның мазмұнын өшіреді.
"a" — қосу режимі. Егер файл жоқ болса, оны жасайды, файл бар болса, жаңа мәліметтерді соңына қосады.
"b" — бинарлы режим. Мысалы, сурет файлдарымен жұмыс істегенде.
"""


#read, readline, readlines
file = open('focus.txt', 'a+')#append
file.write('Bekzhan agai\n')
b  = file.tell()
file.seek(308)
a = file.read()
print(a)


file.close()

#Егер біз ридлайнға сан беретін болсақ онда ол бірінші линиядағы символдар санын оқиды



